The Complete 2024 Web Development Bootcamp/001.Front-End Web Development/001.000.Notes.org
#+title: Sec.1 Front-End Web Development
#+author: Alfredo Mejia
#+options: num:nil html-postamble:nil
#+html_head: <link rel="stylesheet" type="text/css" href="../../scratch/bulma/css/bulma.css" /> <style>body {margin: 5%} h1,h2,h3,h4,h5,h6 {margin-top: 3%}</style>

* Navigation
*Prev*: Home [[[file:../000.Home.html][html]]] [[[file:../000.Home.org][org]]] [[[https://github.com/alfredo-mejia/notes/tree/main/The%20Complete%202024%20Web%20Development%20Bootcamp][github]]]

*Next*: Sec.2 Introduction to HTML [[[file:../002.Introduction to HTML/002.000.Notes.html][html]]] [[[file:../002.Introduction to HTML/002.000.Notes.org][org]]] [[[https://github.com/alfredo-mejia/notes/tree/main/The%20Complete%202024%20Web%20Development%20Bootcamp/002.Introduction%20to%20HTML][github]]]

* Notes

** Section 1.1: What You'll Get In This Course
   - Dr.Angela is part of a company that teaches people how to code in person
   - The in-person bootcamp is the same course as the Udemy course
   - The course is project-drive (great!)

** Section 1.2: The Syllabus
   - [[file:./001.002.The Syllabus.pdf][Syllabus]]
   - The company's name is the 'The App Brewery'
   - Approximately 3-4 months
   - You'll learn HTML 5, CSS 3, FlexBox, Grid, Bootstrap, Web Design, Document Object Model (DOM), JavaScript ES6, React.JS, Unix, Git, GitHub, Node.JS, Express.JS, APIs, Database, SQL, Postgres, Deployment, RESTful APIs, Authentication, Security, Web3, BlockChain, Crypto Token, NFT, and more

** Section 1.3: 12 Rules to Learn to Code
   - [[file:001.003.12 Rules to Learn to Code.pdf][12 Rules to Learn to Code Book (PDF)]]
     
  1. Trick Your Brain with the 20 Minute Rule
     - In order to become better programmers we must code throughout varies days
     - Task-switching is hard so once we set up to see TV it is hard for us to swtich and code
     - Instead, after work, try to set aside 20 minutes to code and you'll see you will spend more than 20 minutes because we have "inertia", in other words, we often don't like to swtich tasks
     - Finally, develop a habit by repeatly coding; after a month we will be naturally inclined to continue that habit
	
  2. Code for a Purpose
     - Following tutorials making simple programs  and copying the code line by line is boring and will drain your motivation
     - The best tutorials are the tutorials creating projects that can actually be used
     - The best way to motivate yourself is by making your own projects
     - After each section (topic) try to create your own project with what you have learned so far

  3. There is No "Perfect" Language to Learn
     - A programming language is simply a tool
     - It doesn't matter which programming language you start, different programming languages are used for different tasks
     - We must pick the best tool for a specific task

  4. Understand What You're Writing
     - Many tutorials promise to teach you how to build an app but following line by line can lead to confusion because sometimes we don't know what we are typing
     - Do try to do this tutorials
     - Tutorials should be able to explain what they are doing so you can understand what you are writing
     - Also, take tutorials that are at your level, too advance might also lead to confusion and thus you'll not learn anything
     - Build a ramp for your journey; too steep and you'll get lost, too shallow and it will be boring for you

  5. It's Ok to Not Know
     - It is common for programmers to have imposter syndrome and undermine their abilities
     - It is okay to ask for help and find references / suggestions online
     - The skill to have is asking good questions and understanding the answer

  6. Be a Copycat
     - Books are great references but to truly learn something you need to make something
     - If you lack ideas, be a copycat (e.g. make your own notepad, MSPaint, Tetris, Flappy Bird, etc.)

  7. Be Accountable
     - Online courses is hard to have accountability because you have no one checking or immediate reward like a grade
     - Accountability and commitment to learning is needed
     - One way to ensure accountability and commitment is to find a coding buddy near the same level as you so both can learn from each other
     - You can find a coding buddy online in FB groups, subreddits, discords, etc. 
     - Find internal and external motivation like financial motivation; for example, think about how much worth is this skill or buy a library card dedicated to be able to go and continue this course, you'll have a motivation to go and do the course because you are paying for the library card
     - Try and get assessed on your own work (it is important to get feedback)
     - A good way to be held accountable is to find a mentor

  8. Keep Learning
     - To stay relevant, you have to keep reinventing yourself
     - There is always new trends, new technologies, and new languages so we need to keep learning to not be left behind
     - Keep learning, stay relevant

  9. Play Foosball
     - Many of the times we left thinking and confused looking at our code either because of a bug or trying to figure out a way to solve an issue
     - Sometimes it is worth stepping away from your code and giving it some time and distance
     - Code less, think more because poorly thought code can become more code lines than expected due to having to rewrite / discover the bugs
     - Easiest code to get rid of is the code that was never written

  10. Get a Mentor
      - Pair programming is an agile software development technique where a learner and a mentor sit down at the same workstation and work on a problem
      - The learner writes code and the mentor reviews the code but the mentor can dispose of dedcades of accumulated wisdown that can lead to improvements in your abilities
      - The mentor shouldn't give you the answers but ask you questions to get you to think for yourself
      - Information is cheap, learn to think, approach a problem, break down a problem, frame problem, etc.
      - Meet a mentor online or in a local meetup (e.g. www.meetup.com)
      - To find a mentor, offer your help in exchange of theirs, no one wants to throw away their free time for some stranger

  11. Get Into The Habit of Chunking
      - If you have a complicated idea break down the program into chunks
      - Then break the chunks (modules) down even further
      - New ideas will emerge from the chunks
      - The more that you break down the probelm and define the issue, the easier it is to package your code into bite-sized chunks
      - The simpler the chunk, the easier it is to tackle
      - To solve a problem, break down the problem into solvable chunks

  12. Break Someone Else's Code
      - Every programmer needs help
      - If you find a code snippet, break it down, understand it, and then use it; possibly later in a different scenario the same principles will be applied
      - Always test your assumptions against the outcome
      - Go to GitHub search up any project (Instgram-clone, Snapchat-clone, Flappy-Bird, etc.) you will find countless open source projects, pick one and download it
      - After finding an open source project, break down the code, tear down the code, break the code, ask yourself various questions about the code, understand how it was built, and finally make your own modifications to the code
      - Once you become good at understanding other people's code, then you'll be able to reverse engineer various apps and make your own from scratch so you can compare with the original

** Section 1.4: Download the Required Software
   - In the course, Dr.Angela Yu will be using Visual Studio Code and Atom but we'll try and use emacs and vim
   - Some extensions that the course will use with VS code are: Live Preview, Prettier, and vscode-icons
   - The course will use Google Chrome and its developer tool suite but, for us, we'll use Safari or Firefox

** Section 1.5: How Does the Internet Work?
   - The internet are wires connected to various computers throughout the world, then within each country there are more wires connected to more computers, eventually wires that lead to your home router
   - Some computers are on 24/7 and provide the files users requests, these are called servers
   - The user is most likely using some software to send those requests (e.g. browser) that software the user is using is called a client
   - So how does the server know which files to give you? Well, the user types in a domain and the browser will then send it to your ISP (Internet Service Provider), the company you pay for internet
   - Then the ISP will relay the message to a DNS (Domain Name System) server and the DNS (basically a large phonebook) will lookup in its database using the domain what IP address corresponds to that domain 
   - Every computer has an IP address (think of it has a postal code, it is a bit more complicated than that) and the IP address can be used to locate and contact that specific computer using their IP address
   - So after the DNS server finds the IP address using the domain, it sends it back to your ISP, and the ISP sends it back to your browser
   - Then the browser makes a direct request to the IP address, so what lives at that IP address? Well typically a server waiting for requests to fulfill
   - When the server receives a request, the server will send back files requested to your computer now using your IP address (information given inside the request)

** Section 1.6: How Do Websites Actually Work? 
   - Typically, the web servers send back three types of files: HTML, CSS, JS
   - HTML is responsible for the content (text, links, images, buttons, etc.) in your website (think of it as the raw materials of a house)
   - CSS is responsible for the styling your website (color of the text, background, shape button, etc.), it will determine how your website will look (think of it as the cosmetics of a house, the color, the type of door, etc.)
   - CSS targets all the content in the HTML and stylizes it
   - JavaScript code is responsible for adding functionality to your website (send email, send request, play video when clicked, create account, etc.) and converting a static website (just display a pretty website) into a dynamic website with functionality that the user can interact with (think of it as the switches, the oven, the toilet, the remote to your garage, etc.)
   - The browser processes or "renders" these files to display the website (e.g. the browser uses the HTML to display the content, the browser uses the CSS to stylize the content, and the browser uses JS to add functionality to the website)
   - You can use the developer tools to inspect and change the HTML, CSS, and even JS but this is only to your local copy of the files; once you refresh the url the server will resend the files and replace your local files

** Section 1.7: How To Get the Most Out of the Course
   - Instead of coding along with the video, first understand what is happening in the video, and after 10 minutes and after understanding the topics try to do it yourself and compare your results with the video
   - Takes notes using the Cornell Note Taking System [[file:./001.007.How To Get the Most Out of the Course (Cornell Note Taking Template).pdf][(pdf template)]]; the page is divided into four sections: topic, keywords / questions, notes, and summary
   - The best way to use the Cornell system is, first, take down notes, after taking down notes review your notes and pick out the most important keywords or questions you are asking yourself, and then lastly, at the second of the section summarize what you have learned in a few bullet points
   - If you are stuck with a topic, first read about the topic, try it out the topic on your own, take a break, and then come back at it (remember the rule #9 play foosball)
   - Practice! Practice! Practice!

** Section 1.8: How to Get Help When You're Stuck
   - Every time you code, before you run, think about what do you expect your code will do and then see what your code actually does and figure out what is causing the difference
   - Bugs and errors are bound so some ways to solve are by rewatching videos, searching on stackoverflow, searching on google, but if none of that works take a look at the solution provided and compare it with your own
   - You can also ask in the Q&A inside the lecture in Udemy

** Section 1.9: Pathfinder
   - There are many suggestions on where to start depending on your experience but for me I am going to try and view all the lectures / modules
