Web/The_Complete_2024_Web_Development_Bootcamp/001.Frontend_Web_Development/001.000.Notes.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-04-29 Tue 14:28 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Section 1: Frontend Web Development</title>
<meta name="author" content="Alfredo Mejia" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://cdn.jsdelivr.net/npm/bulma@1.0.4/css/bulma.min.css" /></head>
<body>
<div id="content" class="content">
<h1 class="title">Section 1: Frontend Web Development</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgad1276d">Navigation</a></li>
<li><a href="#org1e7ccb0">Notes</a>
<ul>
<li><a href="#orgab41682">Section 1.1: What You'll Get In This Course</a></li>
<li><a href="#org6afa9a2">Section 1.2: The Syllabus</a></li>
<li><a href="#orgb41a0f3">Section 1.3: 12 Rules to Learn to Code</a></li>
<li><a href="#orgab936e3">Section 1.4: Download the Required Software</a></li>
<li><a href="#org4d7c606">Section 1.5: How Does the Internet Work?</a></li>
<li><a href="#orgdeefc8a">Section 1.6: How Do Websites Actually Work?</a></li>
<li><a href="#orge76e411">Section 1.7: How To Get the Most Out of the Course</a></li>
<li><a href="#org503661b">Section 1.8: How to Get Help When You're Stuck</a></li>
<li><a href="#orgef2240c">Section 1.9: Pathfinder</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgad1276d" class="outline-2">
<h2 id="orgad1276d">Navigation</h2>
<div class="outline-text-2" id="text-orgad1276d">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Nav</th>
<th scope="col" class="org-left">Title</th>
<th scope="col" class="org-left">Links</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Index</td>
<td class="org-left">Notes Home</td>
<td class="org-left">&vert; <a href="../../../index.html">html</a> &vert; <a href="../../../index.html">org</a> &vert; <a href="https://github.com/alfredo-mejia/notes/tree/main">github</a> &vert;</td>
</tr>

<tr>
<td class="org-left">Home</td>
<td class="org-left">The Complete 2024 Web Development Bootcamp</td>
<td class="org-left">&vert; <a href="../000.Home.html">html</a> &vert; <a href="../000.Home.html">org</a> &vert; <a href="https://github.com/alfredo-mejia/notes/tree/main/Web/The_Complete_2024_Web_Development_Bootcamp">github</a> &vert;</td>
</tr>

<tr>
<td class="org-left">Next</td>
<td class="org-left">Section 2: Introduction to HTML</td>
<td class="org-left">&vert; <a href="../002.Introduction_to_HTML/002.000.Notes.html">html</a> &vert; <a href="../002.Introduction_to_HTML/002.000.Notes.html">org</a> &vert; <a href="https://github.com/alfredo-mejia/notes/tree/main/Web/The_Complete_2024_Web_Development_Bootcamp/002.Introduction_to_HTML">github</a> &vert;</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org1e7ccb0" class="outline-2">
<h2 id="org1e7ccb0">Notes</h2>
<div class="outline-text-2" id="text-org1e7ccb0">
</div>
<div id="outline-container-orgab41682" class="outline-3">
<h3 id="orgab41682">Section 1.1: What You'll Get In This Course</h3>
<div class="outline-text-3" id="text-orgab41682">
<ul class="org-ul">
<li>Dr.Angela is part of a company that teaches people how to code in person</li>
<li>The in-person bootcamp is the same course as the Udemy course</li>
<li>The course is project-drive (great!)</li>
</ul>
</div>
</div>

<div id="outline-container-org6afa9a2" class="outline-3">
<h3 id="org6afa9a2">Section 1.2: The Syllabus</h3>
<div class="outline-text-3" id="text-org6afa9a2">
<ul class="org-ul">
<li><a href="001.002.Syllabus.pdf">Syllabus</a></li>
<li>The company's name is the 'The App Brewery'</li>
<li>Approximately 3-4 months</li>
<li>You'll learn HTML 5, CSS 3, FlexBox, Grid, Bootstrap, Web Design, Document Object Model (DOM), JavaScript ES6, React.JS, Unix, Git, GitHub, Node.JS, Express.JS, APIs, Database, SQL, Postgres, Deployment, RESTful APIs, Authentication, Security, Web3, BlockChain, Crypto Token, NFT, and more</li>
</ul>
</div>
</div>

<div id="outline-container-orgb41a0f3" class="outline-3">
<h3 id="orgb41a0f3">Section 1.3: 12 Rules to Learn to Code</h3>
<div class="outline-text-3" id="text-orgb41a0f3">
<ul class="org-ul">
<li><a href="001.003.12_Rules_to_Learn_to_Code.pdf">12 Rules to Learn to Code Book (PDF)</a></li>
</ul>
<ol class="org-ol">
<li>Trick Your Brain with the 20 Minute Rule
<ul class="org-ul">
<li>In order to become better programmers we must code throughout varies days</li>
<li>Task-switching is hard so once we set up to see TV it is hard for us to swtich and code</li>
<li>Instead, after work, try to set aside 20 minutes to code and you'll see you will spend more than 20 minutes because we have "inertia", in other words, we often don't like to swtich tasks</li>
<li>Finally, develop a habit by repeatly coding; after a month we will be naturally inclined to continue that habit</li>
</ul></li>

<li>Code for a Purpose
<ul class="org-ul">
<li>Following tutorials making simple programs  and copying the code line by line is boring and will drain your motivation</li>
<li>The best tutorials are the tutorials creating projects that can actually be used</li>
<li>The best way to motivate yourself is by making your own projects</li>
<li>After each section (topic) try to create your own project with what you have learned so far</li>
</ul></li>

<li>There is No "Perfect" Language to Learn
<ul class="org-ul">
<li>A programming language is simply a tool</li>
<li>It doesn't matter which programming language you start, different programming languages are used for different tasks</li>
<li>We must pick the best tool for a specific task</li>
</ul></li>

<li>Understand What You're Writing
<ul class="org-ul">
<li>Many tutorials promise to teach you how to build an app but following line by line can lead to confusion because sometimes we don't know what we are typing</li>
<li>Do try to do this tutorials</li>
<li>Tutorials should be able to explain what they are doing so you can understand what you are writing</li>
<li>Also, take tutorials that are at your level, too advance might also lead to confusion and thus you'll not learn anything</li>
<li>Build a ramp for your journey; too steep and you'll get lost, too shallow and it will be boring for you</li>
</ul></li>

<li>It's Ok to Not Know
<ul class="org-ul">
<li>It is common for programmers to have imposter syndrome and undermine their abilities</li>
<li>It is okay to ask for help and find references / suggestions online</li>
<li>The skill to have is asking good questions and understanding the answer</li>
</ul></li>

<li>Be a Copycat
<ul class="org-ul">
<li>Books are great references but to truly learn something you need to make something</li>
<li>If you lack ideas, be a copycat (e.g. make your own notepad, MSPaint, Tetris, Flappy Bird, etc.)</li>
</ul></li>

<li>Be Accountable
<ul class="org-ul">
<li>Online courses is hard to have accountability because you have no one checking or immediate reward like a grade</li>
<li>Accountability and commitment to learning is needed</li>
<li>One way to ensure accountability and commitment is to find a coding buddy near the same level as you so both can learn from each other</li>
<li>You can find a coding buddy online in FB groups, subreddits, discords, etc.</li>
<li>Find internal and external motivation like financial motivation; for example, think about how much worth is this skill or buy a library card dedicated to be able to go and continue this course, you'll have a motivation to go and do the course because you are paying for the library card</li>
<li>Try and get assessed on your own work (it is important to get feedback)</li>
<li>A good way to be held accountable is to find a mentor</li>
</ul></li>

<li>Keep Learning
<ul class="org-ul">
<li>To stay relevant, you have to keep reinventing yourself</li>
<li>There is always new trends, new technologies, and new languages so we need to keep learning to not be left behind</li>
<li>Keep learning, stay relevant</li>
</ul></li>

<li>Play Foosball
<ul class="org-ul">
<li>Many of the times we left thinking and confused looking at our code either because of a bug or trying to figure out a way to solve an issue</li>
<li>Sometimes it is worth stepping away from your code and giving it some time and distance</li>
<li>Code less, think more because poorly thought code can become more code lines than expected due to having to rewrite / discover the bugs</li>
<li>Easiest code to get rid of is the code that was never written</li>
</ul></li>

<li>Get a Mentor
<ul class="org-ul">
<li>Pair programming is an agile software development technique where a learner and a mentor sit down at the same workstation and work on a problem</li>
<li>The learner writes code and the mentor reviews the code but the mentor can dispose of dedcades of accumulated wisdown that can lead to improvements in your abilities</li>
<li>The mentor shouldn't give you the answers but ask you questions to get you to think for yourself</li>
<li>Information is cheap, learn to think, approach a problem, break down a problem, frame problem, etc.</li>
<li>Meet a mentor online or in a local meetup (e.g. www.meetup.com)</li>
<li>To find a mentor, offer your help in exchange of theirs, no one wants to throw away their free time for some stranger</li>
</ul></li>

<li>Get Into The Habit of Chunking
<ul class="org-ul">
<li>If you have a complicated idea break down the program into chunks</li>
<li>Then break the chunks (modules) down even further</li>
<li>New ideas will emerge from the chunks</li>
<li>The more that you break down the probelm and define the issue, the easier it is to package your code into bite-sized chunks</li>
<li>The simpler the chunk, the easier it is to tackle</li>
<li>To solve a problem, break down the problem into solvable chunks</li>
</ul></li>

<li>Break Someone Else's Code
<ul class="org-ul">
<li>Every programmer needs help</li>
<li>If you find a code snippet, break it down, understand it, and then use it; possibly later in a different scenario the same principles will be applied</li>
<li>Always test your assumptions against the outcome</li>
<li>Go to GitHub search up any project (Instgram-clone, Snapchat-clone, Flappy-Bird, etc.) you will find countless open source projects, pick one and download it</li>
<li>After finding an open source project, break down the code, tear down the code, break the code, ask yourself various questions about the code, understand how it was built, and finally make your own modifications to the code</li>
<li>Once you become good at understanding other people's code, then you'll be able to reverse engineer various apps and make your own from scratch so you can compare with the original</li>
</ul></li>
</ol>
</div>
</div>

<div id="outline-container-orgab936e3" class="outline-3">
<h3 id="orgab936e3">Section 1.4: Download the Required Software</h3>
<div class="outline-text-3" id="text-orgab936e3">
<ul class="org-ul">
<li>In the course, Dr.Angela Yu will be using Visual Studio Code and Atom but we'll try and use emacs and vim</li>
<li>Some extensions that the course will use with VS code are: Live Preview, Prettier, and vscode-icons</li>
<li>The course will use Google Chrome and its developer tool suite but, for us, we'll use Safari or Firefox</li>
</ul>
</div>
</div>

<div id="outline-container-org4d7c606" class="outline-3">
<h3 id="org4d7c606">Section 1.5: How Does the Internet Work?</h3>
<div class="outline-text-3" id="text-org4d7c606">
<ul class="org-ul">
<li>The internet are wires connected to various computers throughout the world, then within each country there are more wires connected to more computers, eventually wires that lead to your home router</li>
<li>Some computers are on 24/7 and provide the files users requests, these are called servers</li>
<li>The user is most likely using some software to send those requests (e.g. browser) that software the user is using is called a client</li>
<li>So how does the server know which files to give you? Well, the user types in a domain and the browser will then send it to your ISP (Internet Service Provider), the company you pay for internet</li>
<li>Then the ISP will relay the message to a DNS (Domain Name System) server and the DNS (basically a large phonebook) will lookup in its database using the domain what IP address corresponds to that domain</li>
<li>Every computer has an IP address (think of it has a postal code, it is a bit more complicated than that) and the IP address can be used to locate and contact that specific computer using their IP address</li>
<li>So after the DNS server finds the IP address using the domain, it sends it back to your ISP, and the ISP sends it back to your browser</li>
<li>Then the browser makes a direct request to the IP address, so what lives at that IP address? Well typically a server waiting for requests to fulfill</li>
<li>When the server receives a request, the server will send back files requested to your computer now using your IP address (information given inside the request)</li>
</ul>
</div>
</div>

<div id="outline-container-orgdeefc8a" class="outline-3">
<h3 id="orgdeefc8a">Section 1.6: How Do Websites Actually Work?</h3>
<div class="outline-text-3" id="text-orgdeefc8a">
<ul class="org-ul">
<li>Typically, the web servers send back three types of files: HTML, CSS, JS</li>
<li>HTML is responsible for the content (text, links, images, buttons, etc.) in your website (think of it as the raw materials of a house)</li>
<li>CSS is responsible for the styling your website (color of the text, background, shape button, etc.), it will determine how your website will look (think of it as the cosmetics of a house, the color, the type of door, etc.)</li>
<li>CSS targets all the content in the HTML and stylizes it</li>
<li>JavaScript code is responsible for adding functionality to your website (send email, send request, play video when clicked, create account, etc.) and converting a static website (just display a pretty website) into a dynamic website with functionality that the user can interact with (think of it as the switches, the oven, the toilet, the remote to your garage, etc.)</li>
<li>The browser processes or "renders" these files to display the website (e.g. the browser uses the HTML to display the content, the browser uses the CSS to stylize the content, and the browser uses JS to add functionality to the website)</li>
<li>You can use the developer tools to inspect and change the HTML, CSS, and even JS but this is only to your local copy of the files; once you refresh the url the server will resend the files and replace your local files</li>
</ul>
</div>
</div>

<div id="outline-container-orge76e411" class="outline-3">
<h3 id="orge76e411">Section 1.7: How To Get the Most Out of the Course</h3>
<div class="outline-text-3" id="text-orge76e411">
<ul class="org-ul">
<li>Instead of coding along with the video, first understand what is happening in the video, and after 10 minutes and after understanding the topics try to do it yourself and compare your results with the video</li>
<li>Takes notes using the Cornell Note Taking System <a href="001.007.How_To_Get_the_Most_Out_of_the_Course_Cornell_Note_Taking_Template.pdf">(pdf template)</a>; the page is divided into four sections: topic, keywords / questions, notes, and summary</li>
<li>The best way to use the Cornell system is, first, take down notes, after taking down notes review your notes and pick out the most important keywords or questions you are asking yourself, and then lastly, at the second of the section summarize what you have learned in a few bullet points</li>
<li>If you are stuck with a topic, first read about the topic, try it out the topic on your own, take a break, and then come back at it (remember the rule #9 play foosball)</li>
<li>Practice! Practice! Practice!</li>
</ul>
</div>
</div>

<div id="outline-container-org503661b" class="outline-3">
<h3 id="org503661b">Section 1.8: How to Get Help When You're Stuck</h3>
<div class="outline-text-3" id="text-org503661b">
<ul class="org-ul">
<li>Every time you code, before you run, think about what do you expect your code will do and then see what your code actually does and figure out what is causing the difference</li>
<li>Bugs and errors are bound so some ways to solve are by rewatching videos, searching on stackoverflow, searching on google, but if none of that works take a look at the solution provided and compare it with your own</li>
<li>You can also ask in the Q&amp;A inside the lecture in Udemy</li>
</ul>
</div>
</div>

<div id="outline-container-orgef2240c" class="outline-3">
<h3 id="orgef2240c">Section 1.9: Pathfinder</h3>
<div class="outline-text-3" id="text-orgef2240c">
<ul class="org-ul">
<li>There are many suggestions on where to start depending on your experience but for me I am going to try and view all the lectures / modules</li>
</ul>
</div>
</div>
</div>
</div>
</body>
</html>
